import Vue from 'vue'

export default ({ app }) => {
  Vue.prototype.$const = {
    expenditure: {
      2020: {
        delay: 4,
        stracture: {
          // 0: '歳出総額',
          1: { name: '議会費' },
          2: {
            name: '総務費',
            child: {
              3: { name: '総務管理費' },
              4: { name: '企画費' },
              5: { name: '徴税費' },
              6: { name: '市町村振興費' },
              7: { name: '選挙費' },
              8: { name: '防災費' },
              9: { name: '統計調査費' },
              10: { name: '人事委員会費' },
              11: { name: '監査委員費' }
            }
          },
          12: {
            name: '民生費',
            child: {
              13: { name: '社会福祉費' },
              14: { name: '老人福祉費' },
              15: { name: '児童福祉費' },
              16: { name: '生活保護費' },
              17: { name: '災害救助費' }
            }
          },
          18: {
            name: '衛生費',
            child: {
              19: { name: '公衆衛生費' },
              20: { name: '結核対策費' },
              21: { name: '精神衛生費' },
              22: { name: '環境衛生費' },
              23: { name: '清掃費' },
              24: { name: '保健所費' },
              25: { name: '医薬費' }
            }
          },
          26: {
            name: '労働費',
            child: {
              27: { name: '労政費' },
              28: { name: '職業訓練費' },
              29: { name: '失業対策費' },
              30: { name: '労働委員会費' }
            }
          },
          31: {
            name: '農林水産業費',
            child: {
              32: { name: '農業費' },
              33: { name: '畜産業費' },
              34: { name: '農地費' },
              35: { name: '林業費' },
              36: { name: '水産業費' }
            }
          },
          37: {
            name: '商工費',
            child: {
              38: { name: '商業費' },
              39: { name: '工鉱業費' },
              40: { name: '観光費' }
            }
          },
          41: {
            name: '土木費',
            child: {
              42: { name: '土木管理費' },
              43: { name: '道路橋りょう費' },
              44: { name: '河川海岸費' },
              45: { name: '港湾費' },
              46: {
                name: '都市計画費',
                child: {
                  47: { name: '街路費' },
                  48: { name: '公園費' },
                  49: { name: '下水道費' },
                  50: { name: '区画整理費等' }
                }
              },
              51: { name: '住宅費' },
              52: { name: '空港費' }
            }
          },
          53: { name: '警察費' },
          54: { name: '消防費' },
          55: {
            name: '教育費',
            child: {
              56: { name: '教育総務費' },
              57: { name: '小学校費' },
              58: { name: '中学校費' },
              59: { name: '高等学校費' },
              60: { name: '特別支援学校費' },
              61: { name: '幼稚園費' },
              62: { name: '社会教育費' },
              63: {
                name: '保健体育費',
                child: {
                  64: { name: '体育施設費等' },
                  65: { name: '学校給食費' }
                }
              },
              66: { name: '大学費' }
            }
          },
          67: {
            name: '災害復旧費',
            child: {
              68: {
                name: '農林水産施設',
                child: {
                  69: { name: '農地' },
                  70: { name: '農業用施設' },
                  71: { name: '林業用施設' },
                  72: { name: '漁業用施設' },
                  73: { name: '共同利用施設' },
                  74: { name: 'その他' }
                }
              },
              75: {
                name: '公共土木施設',
                child: {
                  76: { name: '河川' },
                  77: { name: '海岸' },
                  78: { name: '道路' },
                  79: { name: '港湾' },
                  80: { name: '漁港' },
                  81: { name: '下水道' },
                  82: { name: '公園' },
                  83: { name: 'その他' }
                }
              },
              84: {
                name: 'その他',
                child: {
                  85: { name: '公立学校' },
                  86: { name: '公営住宅' },
                  87: { name: '社会福祉施設' },
                  88: { name: 'その他' }
                }
              }
            }
          },
          89: { name: '公債費' },
          90: {
            name: '諸支出金',
            child: {
              91: { name: '普通財産取得費' },
              92: { name: '公営企業費' }
            }
          },
          93: { name: '前年度繰上充用金' },
          94: { name: '利子割交付金' },
          95: { name: '配当割交付金' },
          96: { name: '株式等譲渡所得割交付金' },
          97: { name: '分離課税所得割交付金' },
          98: { name: '地方消費税交付金' },
          99: { name: 'ゴルフ場利用税交付金' },
          100: { name: '特別地方消費税交付金' },
          101: { name: '自動車取得税交付金' },
          102: { name: '軽油引取税交付金' },
          103: { name: '自動車税環境性能割交付金' },
          104: { name: '法人事業税交付金' },
          105: { name: '特別区財政調整交付金' }
        }
      }
    }
  }
}
